app/controllers/goals_controller.rb

  def create
    debugger
    params[:goal][:private?] = params[:goal][:private?].nil? ? true : false
    params[:goal][:completed?] = params[:goal][:completed?].nil? ? true : false
    params[:goal][:user_id] = current_user.id
    # byebug
    @goal = Goal.new(goal_params)
    @user = current_user
    # byebug
    if @goal.save!
---
INSERT INTO "goals" ("title", "details", "private?", "completed?", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "hfg"], ["details", "hfghgf"], ["private?", "t"], ["completed?", "t"], ["user_id", 2], ["created_at", "2018-07-14 00:05:06.327567"], ["updated_at", "2018-07-14 00:05:06.327567"]]